# YOLO11s + P2 detection head
# 在标准 yolo11s 的 P3/P4/P5 三个检测头基础上增加 P2/4 检测头，专门给小目标用。
# 小目标在 fruit_detect 任务里占大多数（labels.jpg 显示大部分 bbox 宽高 < 0.1），P2 头预期能拿到 Recall。
#
# 用法：
#   model = YOLO("configs/yolo11s-p2.yaml").load("yolo11s.pt")
#   .load() 会把 yolo11s.pt 里和当前结构匹配的权重（backbone + 公共 neck）拷过来，
#   不匹配的检测头会随机初始化，相当于 backbone 预训练 + head 从零训。

nc: 3

# 只保留 s 规模。如果以后要切换规模，把这里改成完整的 n/s/m/l/x 表即可。
scales:
  s: [0.50, 0.50, 1024]

backbone:
  - [-1, 1, Conv, [64, 3, 2]]          # 0  - P1/2
  - [-1, 1, Conv, [128, 3, 2]]         # 1  - P2/4
  - [-1, 2, C3k2, [256, False, 0.25]]  # 2
  - [-1, 1, Conv, [256, 3, 2]]         # 3  - P3/8
  - [-1, 2, C3k2, [512, False, 0.25]]  # 4
  - [-1, 1, Conv, [512, 3, 2]]         # 5  - P4/16
  - [-1, 2, C3k2, [512, True]]         # 6
  - [-1, 1, Conv, [1024, 3, 2]]        # 7  - P5/32
  - [-1, 2, C3k2, [1024, True]]        # 8
  - [-1, 1, SPPF, [1024, 5]]           # 9
  - [-1, 2, C2PSA, [1024]]             # 10

head:
  # top-down P5 -> P4
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 11
  - [[-1, 6], 1, Concat, [1]]                    # 12
  - [-1, 2, C3k2, [512, False]]                  # 13

  # top-down P4 -> P3
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 14
  - [[-1, 4], 1, Concat, [1]]                    # 15
  - [-1, 2, C3k2, [256, False]]                  # 16

  # top-down P3 -> P2 (新增)
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]   # 17
  - [[-1, 2], 1, Concat, [1]]                    # 18
  - [-1, 2, C3k2, [128, False]]                  # 19  - P2/4 head

  # bottom-up P2 -> P3
  - [-1, 1, Conv, [128, 3, 2]]                   # 20
  - [[-1, 16], 1, Concat, [1]]                   # 21
  - [-1, 2, C3k2, [256, False]]                  # 22  - P3/8 head

  # bottom-up P3 -> P4
  - [-1, 1, Conv, [256, 3, 2]]                   # 23
  - [[-1, 13], 1, Concat, [1]]                   # 24
  - [-1, 2, C3k2, [512, False]]                  # 25  - P4/16 head

  # bottom-up P4 -> P5
  - [-1, 1, Conv, [512, 3, 2]]                   # 26
  - [[-1, 10], 1, Concat, [1]]                   # 27
  - [-1, 2, C3k2, [1024, True]]                  # 28  - P5/32 head

  # 四个检测头：P2 / P3 / P4 / P5
  - [[19, 22, 25, 28], 1, Detect, [nc]]          # 29
